app/views/articles/show.html.erb

    <ul id="comments-box">
    <% @article.comments.each do |comm|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 11]]