app/controllers/articles_controller.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2016-05-08 18:47:50.557753"], ["id", 10]]
---
  def show
    @article.update_visits_count

INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "jkbkbkbkc"], ["body", "vlsvlfnfblbfknldfnlvd\r\n"], ["user_id", 1], ["visits_count", 0], ["created_at", "2016-05-08 18:38:39.710143"], ["updated_at", "2016-05-08 18:38:39.710143"]]
---
  def create
    @article = current_user.articles.new(article_params)
     if @article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "primera entrada!!"], ["body", "hola que talnclsnn osn l s pmpp"], ["updated_at", "2016-05-08 05:27:33.741816"], ["id", 1]]
---
  def update
    if @article.update(article_params)