app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 0], ["article_id", 11], ["body", "que buen post"], ["created_at", "2016-05-08 19:08:42.765622"], ["updated_at", "2016-05-08 19:08:42.765622"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 0], ["updated_at", "2016-05-08 19:10:36.357188"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 11]]
---
    def set_article
      @article = Article.find(params[:article_id])